--[[
@author:mid
@usage: require "Config.fanXingCfg"

]]

local t = {
    [Common_PlayID.chongRen_MJ] = {
        {[1] = "平胡", [2] = 2},
        {[1] = "十三烂", [2] = 4},
        {[1] = "七星十三烂", [2] = 8},
        {[1] = "碰碰胡", [2] = 8},
        {[1] = "七对", [2] = 10},
        {[1] = "天胡", [2] = 10},
        {[1] = "地胡", [2] = 10},
        {[1] = "真清一色", [2] = 20},
        {[1] = "假清一色", [2] = 8},
        {[1] = "真胡字一色", [2] = 20},
        {[1] = "假胡字一色", [2] = 10}
    },
    [Common_PlayID.yiHuang_MJ] = {
        {[1] = "平胡", [2] = 1},
        {[1] = "十三烂", [2] = 2},
        {[1] = "七星十三烂", [2] = 4},
        {[1] = "碰碰胡", [2] = 4},
        {[1] = "碰碰胡清一色", [2] = 10},
        {[1] = "碰碰胡字一色", [2] = 14},
        {[1] = "小七对", [2] = 5},
        {[1] = "七对清一色", [2] = 11},
        {[1] = "七对字一色", [2] = 20},
        {[1] = "清一色真胡", [2] = 6},
        {[1] = "清一色假胡", [2] = 3},
        {[1] = "字一色真胡", [2] = 14},
        {[1] = "字一色假胡", [2] = 6}
    },
    [Common_PlayID.leAn_MJ] = {
        {[1] = "平胡", [2] = 2},
        {[1] = "十三烂", [2] = 3},
        {[1] = "七星十三烂", [2] = 5},
        {[1] = "碰碰胡", [2] = 5},
        {[1] = "碰碰胡清一色", [2] = 20},
        {[1] = "碰碰胡字一色", [2] = 40},
        {[1] = "小七对", [2] = 10},
        {[1] = "七对清一色", [2] = 20},
        {[1] = "七对字一色", [2] = 40},
        {[1] = "四归一七对", [2] = 20},
        {[1] = "八归一七对", [2] = 40},
        {[1] = "十二归一七对", [2] = 80},
        {[1] = "假清一色", [2] = 5},
        {[1] = "真清一色", [2] = 10},
        {[1] = "假胡字一色", [2] = 10},
        {[1] = "真胡字一色", [2] = 20},
        {[1] = "四归一", [2] = 4},
        {[1] = "八归一", [2] = 8},
        {[1] = "十二归一", [2] = 16},
        {[1] = "清一色假胡四归一", [2] = 10},
        {[1] = "清一色真胡四归一", [2] = 20},
        {[1] = "清一色假胡八归一", [2] = 20},
        {[1] = "清一色真胡八归一", [2] = 40},
        {[1] = "清一色假胡十二归一", [2] = 40},
        {[1] = "清一色真胡十二归一", [2] = 80},
        {[1] = "字一色假胡四归一", [2] = 20},
        {[1] = "字一色真胡四归一", [2] = 40},
        {[1] = "字一色假胡八归一", [2] = 40},
        {[1] = "字一色真胡八归一", [2] = 80},
        {[1] = "字一色假胡十二归一", [2] = 80},
        {[1] = "字一色真胡十二归一", [2] = 160},
        {[1] = "清一色真胡四归一七对", [2] = 40},
        {[1] = "清一色真胡八归一七对", [2] = 80},
        {[1] = "清一色真胡十二归一七对", [2] = 160},
        {[1] = "字一色真胡四归一七对", [2] = 80},
        {[1] = "字一色真胡八归一七对", [2] = 160},
        {[1] = "字一色真胡十二归一七对", [2] = 320}
    }
}

return t
